In [1]:
import pandas as pd

# Adding & Removing Columns

In [2]:
# Sample Data Frame
df = pd.DataFrame({
    "Name": ["Onkar", "Amit", "Sara", "Rohit"],
    "Salary": [50000, 65000, 55000, 70000],
    "Experience": [1, 3, 2, 5]
})

df

    Name  Salary  Experience
0  Onkar   50000           1
1   Amit   65000           3
2   Sara   55000           2
3  Rohit   70000           5

## 1. Add a New Column (Direct Assignment)

In [3]:
# Add a constant value
df["Company"] = "ABC Corp"
df

    Name  Salary  Experience   Company
0  Onkar   50000           1  ABC Corp
1   Amit   65000           3  ABC Corp
2   Sara   55000           2  ABC Corp
3  Rohit   70000           5  ABC Corp

In [4]:
# Add using existing column
df["Bonus"] = df["Salary"] * 0.10
df

    Name  Salary  Experience   Company   Bonus
0  Onkar   50000           1  ABC Corp  5000.0
1   Amit   65000           3  ABC Corp  6500.0
2   Sara   55000           2  ABC Corp  5500.0
3  Rohit   70000           5  ABC Corp  7000.0

## 2. Add column using `.assign()`

`df = df.assign(Col_name = Data)`

In [5]:
df = df.assign(TotalPay=df["Salary"] + df["Bonus"])
df

    Name  Salary  Experience   Company   Bonus  TotalPay
0  Onkar   50000           1  ABC Corp  5000.0   55000.0
1   Amit   65000           3  ABC Corp  6500.0   71500.0
2   Sara   55000           2  ABC Corp  5500.0   60500.0
3  Rohit   70000           5  ABC Corp  7000.0   77000.0

## 3. Add column using condition `np.where`

In [6]:
import numpy as np

In [7]:
df["Level"] = np.where(df["Experience"]>=3, "Senior", "Junior")
df

    Name  Salary  Experience   Company   Bonus  TotalPay   Level
0  Onkar   50000           1  ABC Corp  5000.0   55000.0  Junior
1   Amit   65000           3  ABC Corp  6500.0   71500.0  Senior
2   Sara   55000           2  ABC Corp  5500.0   60500.0  Junior
3  Rohit   70000           5  ABC Corp  7000.0   77000.0  Senior

## 4. Add Column using `apply()`

In [8]:
df["Tax"] = df["Salary"].apply(lambda x: x * 0.05)
df

    Name  Salary  Experience   Company   Bonus  TotalPay   Level     Tax
0  Onkar   50000           1  ABC Corp  5000.0   55000.0  Junior  2500.0
1   Amit   65000           3  ABC Corp  6500.0   71500.0  Senior  3250.0
2   Sara   55000           2  ABC Corp  5500.0   60500.0  Junior  2750.0
3  Rohit   70000           5  ABC Corp  7000.0   77000.0  Senior  3500.0

## 5. Insert Column at a Specific Position

The the position starts from 0

In [9]:
df.insert(1, "Department", ["IT", "HR", "IT", "Finance"])
df

,Name,Department,Salary,Experience,Company,Bonus,TotalPay,Level,Tax
0,Onkar,IT,50000,1,ABC Corp,5000.0,55000.0,Junior,2500.0
1,Amit,HR,65000,3,ABC Corp,6500.0,71500.0,Senior,3250.0
2,Sara,IT,55000,2,ABC Corp,5500.0,60500.0,Junior,2750.0
3,Rohit,Finance,70000,5,ABC Corp,7000.0,77000.0,Senior,3500.0

## 6. Remove Columns

In [13]:
# Remove one column
df.drop("Tax", axis=1)

    Name Department  Salary  Experience   Company   Bonus  TotalPay   Level
0  Onkar         IT   50000           1  ABC Corp  5000.0   55000.0  Junior
1   Amit         HR   65000           3  ABC Corp  6500.0   71500.0  Senior
2   Sara         IT   55000           2  ABC Corp  5500.0   60500.0  Junior
3  Rohit    Finance   70000           5  ABC Corp  7000.0   77000.0  Senior

In [14]:
# Remove multiple columns
df.drop(["TotalPay", "Tax"], axis=1)

    Name Department  Salary  Experience   Company   Bonus   Level
0  Onkar         IT   50000           1  ABC Corp  5000.0  Junior
1   Amit         HR   65000           3  ABC Corp  6500.0  Senior
2   Sara         IT   55000           2  ABC Corp  5500.0  Junior
3  Rohit    Finance   70000           5  ABC Corp  7000.0  Senior

In [15]:
# Remove column permanently
df.drop("Bonus", axis=1, inplace=True)
df

    Name Department  Salary  Experience   Company  TotalPay   Level     Tax
0  Onkar         IT   50000           1  ABC Corp   55000.0  Junior  2500.0
1   Amit         HR   65000           3  ABC Corp   71500.0  Senior  3250.0
2   Sara         IT   55000           2  ABC Corp   60500.0  Junior  2750.0
3  Rohit    Finance   70000           5  ABC Corp   77000.0  Senior  3500.0

## 7. Drop Columns using `del`

In [17]:
del df["Company"]

In [18]:
df

    Name Department  Salary  Experience  TotalPay   Level     Tax
0  Onkar         IT   50000           1   55000.0  Junior  2500.0
1   Amit         HR   65000           3   71500.0  Senior  3250.0
2   Sara         IT   55000           2   60500.0  Junior  2750.0
3  Rohit    Finance   70000           5   77000.0  Senior  3500.0